app/controllers/laboratory_controller.rb

SELECT  "laboratories".* FROM "laboratories" WHERE "laboratories"."name" = $1 ORDER BY "laboratories"."id" ASC LIMIT $2  [["name", "NCC"], ["LIMIT", 1]]
SELECT "inventories".* FROM "inventories" WHERE "inventories"."laboratory_id" = 1
---
  def show
    @laboratory = Laboratory.where(name: params['id']).first
    raise ActiveRecord::RecordNotFound unless @laboratory
    inventories = Inventory.where(laboratory: @laboratory).all

SELECT  "laboratories".* FROM "laboratories" WHERE "laboratories"."name" = $1 LIMIT $2  [["name", "NCC"], ["LIMIT", 1]]
---
  def create
    permitted = Authenticator.new(authorization:
                                  request.headers['Authorization']).permitted?
    laboratory = Laboratory.find_by(name: request.headers['Authorization'].split(':')[0])