app/controllers/reservation_controller.rb

  def create
    permitted = Authenticator.new(authorization: request.headers['Authorization']).user_permitted?
    return render json: { status: 403 } unless permitted
    inventory = Inventory.find(params['inventory'])
    return render json: { status: 404 } unless inventory
    reservation_attributes = {
        user: User.find_by(nrp: params['nrp']),
        inventory: inventory,
        start_date: params['start_date'],
        end_date: params['end_date'],
        reason: params['reason'],
        status: 'Belum Diterima'
---
SELECT  "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."nrp" = $1 LIMIT $2  [["nrp", "5115100071"], ["LIMIT", 1]]