app/controllers/user_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."nrp" = $1 LIMIT $2  [["nrp", "5115100071"], ["LIMIT", 1]]
---
  def show
    user = User.find_by(nrp: params['id'])